poc/consumer/examples/wcf-request.xml


<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"
	xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<s:Header>
		<a:Action s:mustUnderstand="1" u:Id="_3">http://lh-z3jyrnwtj9d7/Echo/EchoServiceContract/Echo
		</a:Action>
		<a:MessageID u:Id="_4">urn:uuid:6185dea0-aa1e-4e4f-a012-bae1651d187b</a:MessageID>
		<a:ReplyTo u:Id="_5">
			<a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
		</a:ReplyTo>
		<a:To s:mustUnderstand="1" u:Id="_6">http://localhost/Echo/Service.svc/Echo</a:To>
		<o:Security s:mustUnderstand="1" xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<u:Timestamp u:Id="uuid-ff1004f0-7f9f-4226-ae06-422861f1ca01-12">
				<u:Created>2008-12-03T11:07:54.129Z</u:Created>
				<u:Expires>2008-12-03T11:12:54.129Z</u:Expires>
			</u:Timestamp>
			<SecurityContextToken u:Id="uuid-9c82399a-1d42-4979-886c-195ecda45b87-1" xmlns="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512">
				<Identifier>urn:uuid:ff7c7cb9-a643-427c-ae22-ae7ab5c2b1d1</Identifier>
			</SecurityContextToken>
			<sc:DerivedKeyToken u:Id="_0" xmlns:sc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512">
				<o:SecurityTokenReference>
					<o:Reference URI="#uuid-9c82399a-1d42-4979-886c-195ecda45b87-1"></o:Reference>
				</o:SecurityTokenReference>
				<sc:Offset>0</sc:Offset>
				<sc:Length>24</sc:Length>
				<sc:Nonce>
					<!-- Removed-->
				</sc:Nonce>
			</sc:DerivedKeyToken>
			<saml:Assertion MajorVersion="1" MinorVersion="1" AssertionID="_3a9a7c80-4b20-4f13-a695-c1ecc9843008" Issuer="http://lh-z3jyrnwtj9d7/Saml2STS/Service.svc"
				IssueInstant="2008-12-03T11:07:52.410Z" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion">
				<saml:Conditions NotBefore="2008-12-03T11:07:52.379Z" NotOnOrAfter="2008-12-03T21:07:52.379Z">
					<saml:AudienceRestrictionCondition>
						<saml:Audience>http://localhost/Echo/Service.svc/Echo</saml:Audience>
					</saml:AudienceRestrictionCondition>
				</saml:Conditions>
				<saml:AttributeStatement>
					<saml:Subject>
						<saml:SubjectConfirmation>
							<saml:ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key
							</saml:ConfirmationMethod>
							<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
								<e:EncryptedKey xmlns:e="http://www.w3.org/2001/04/xmlenc#">
									<e:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p">
										<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></DigestMethod>
									</e:EncryptionMethod>
									<KeyInfo>
										<o:SecurityTokenReference>
											<X509Data>
												<X509IssuerSerial>
													<X509IssuerName>CN=localhost</X509IssuerName>
													<X509SerialNumber>97388553774094145484769834879401591914</X509SerialNumber>
												</X509IssuerSerial>
											</X509Data>
										</o:SecurityTokenReference>
									</KeyInfo>
									<e:CipherData>
										<e:CipherValue>
											N5SdC/fkrH48UsACnDqTGdq0ndFW+zEpXNDg2hQT57BAdvzjqGObrDzGzprTA1EbuO8vCWZ5QDDaRwhTQWz1UyqXbfk1T5vn5TbZvLmD5jwlpIq7Uhz7xOoNR/lvNDMFZzJNexLU5YacHpU595O4f8bmlVhCoCSbZvBCkX5qj6g=
										</e:CipherValue>
									</e:CipherData>
								</e:EncryptedKey>
							</KeyInfo>
						</saml:SubjectConfirmation>
					</saml:Subject>
					<saml:Attribute AttributeName="name" AttributeNamespace="http://schemas.xmlsoap.org/ws/2005/05/identity/claims">
						<saml:AttributeValue>
							<!-- Removed-->
						</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
				<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<ds:SignedInfo>
						<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod>
						<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod>
						<ds:Reference URI="#_3a9a7c80-4b20-4f13-a695-c1ecc9843008">
							<ds:Transforms>
								<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"></ds:Transform>
								<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform>
							</ds:Transforms>
							<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
							<ds:DigestValue>Ed/WlvxtzrN4hcig7GYlKLEl8TU=</ds:DigestValue>
						</ds:Reference>
					</ds:SignedInfo>
					<ds:SignatureValue>
						O/blDWf6cp2qt6lEqbjKylCvK3jzOVcwH1Ef0WJH8HZiSERRPm4GFT88GEVJtAflUYGYMIw1i3UcXXguXYkwfarJ3Yj4c461OvGti1FpwiobI8hGSuqA28YSyp6PY79+FU7E5fq/T5dodKBu6FNbrFoY56275RetY2E/MtoiZAI=
					</ds:SignatureValue>
					<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
						<X509Data>
							<X509Certificate>
								MIIB3DCCAUmgAwIBAgIQ7Xggpym/4bFA1tzUK7OOETAJBgUrDgMCHQUAMA4xDDAKBgNVBAMTA1NUUzAeFw05OTEyMzEyMzAwMDBaFw0zNTEyMzEyMzAwMDBaMA4xDDAKBgNVBAMTA1NUUzCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEAop3CZQArO/ywTDqxOCsZgE3GgMgWw8RuR3OQZOr3TAhJjES0Vdy87efOumTKHSY4ZII8/dW1znjbxclhGu/6b+008vWXCaejTLSTFqApPklywMYh//0Xi4c34NT49zxjdwqbTQU0hRFiIWIx4yRzxyrk5UBNRzR/UZX/kRtd+nkCAwEAAaNDMEEwPwYDVR0BBDgwNoAQyBGA3hFx3FJ5lsMw8jHOa6EQMA4xDDAKBgNVBAMTA1NUU4IQ7Xggpym/4bFA1tzUK7OOETAJBgUrDgMCHQUAA4GBAEeiU5+NrmXL1QH/3aU2qJX0JWxlmfVbysEfFsw5F1uDjWm0bKqrwW/vLEzvatODPtc8fQhwM0ZAc24FWdlHQuEtK+pkwZItnpXWsfmtMcNwPXRQpGKq63JUA9eDyp8rR1ZVbwMVyuFM2rGt5QTvT7iRHWFIhpzTdzUss3PrEXOy
							</X509Certificate>
						</X509Data>
					</KeyInfo>
				</ds:Signature>
			</saml:Assertion>
			<sc:DerivedKeyToken u:Id="_7" xmlns:sc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512">
				<o:SecurityTokenReference>
					<o:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.0#SAMLAssertionID">_3a9a7c80-4b20-4f13-a695-c1ecc9843008</o:KeyIdentifier>
				</o:SecurityTokenReference>
				<sc:Offset>0</sc:Offset>
				<sc:Length>24</sc:Length>
				<sc:Nonce>
					<!-- Removed-->
				</sc:Nonce>
			</sc:DerivedKeyToken>
			<Signature Id="_1" xmlns="http://www.w3.org/2000/09/xmldsig#">
				<SignedInfo>
					<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></CanonicalizationMethod>
					<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"></SignatureMethod>
					<Reference URI="#_3">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></Transform>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></DigestMethod>
						<DigestValue>ZYYWJpUphCwabkFyRmQ9Lo5YOuY=</DigestValue>
					</Reference>
					<Reference URI="#_4">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></Transform>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></DigestMethod>
						<DigestValue>TrGkKZP8oKQZG8nSY9CgDQkz1C4=</DigestValue>
					</Reference>
					<Reference URI="#_5">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></Transform>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></DigestMethod>
						<DigestValue>k69pykploFPkXhw5ogDHcjcJUI0=</DigestValue>
					</Reference>
					<Reference URI="#_6">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></Transform>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></DigestMethod>
						<DigestValue>NSqFg8tFqc0dBxJfSd/af10mkdQ=</DigestValue>
					</Reference>
					<Reference URI="#uuid-ff1004f0-7f9f-4226-ae06-422861f1ca01-12">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></Transform>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></DigestMethod>
						<DigestValue>06jtpXrgItZNMmSvxMVfczxUX6A=</DigestValue>
					</Reference>
				</SignedInfo>
				<SignatureValue>PaXURvvMIOKH/J9fRcrvhtRHfyE=</SignatureValue>
				<KeyInfo>
					<o:SecurityTokenReference>
						<o:Reference URI="#_0"></o:Reference>
					</o:SecurityTokenReference>
				</KeyInfo>
			</Signature>
			<Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
				<SignedInfo>
					<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></CanonicalizationMethod>
					<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"></SignatureMethod>
					<Reference URI="#_1">
						<Transforms>
							<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></Transform>
						</Transforms>
						<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></DigestMethod>
						<DigestValue>qXEJ7vIleRaJGyNQSpPs/lfpp3g=</DigestValue>
					</Reference>
				</SignedInfo>
				<SignatureValue>hTr4ZqosIG6ZX+kWK5MKqWJif08=</SignatureValue>
				<KeyInfo>
					<o:SecurityTokenReference>
						<o:Reference URI="#_7"></o:Reference>
					</o:SecurityTokenReference>
				</KeyInfo>
			</Signature>
		</o:Security>
	</s:Header>
	<s:Body>
		<Echo xmlns="http://lh-z3jyrnwtj9d7/Echo">
			<stringToEcho>Polsesnask</stringToEcho>
		</Echo>
	</s:Body>
</s:Envelope>